import React from 'react';
import Slider from "./Slider"

const NewsSlider = () => {
    let news = [
        {
            image:require("../../resources/newsImage.png"),
            title:"قال فضلت الامام الكبار: ان القرآنا الكريم استعمال منذ اسلوب الاحوارمع الشباب, وليس اسلوب الملا والأمر والنهي وعرضلنا النموذجين أحدهما",
            date:"منذ 1 دقيقة",
            desc:"قال فضلت الامام الكبار: ان القرآنا الكريم استعمال منذ اسلوب الاحوارمع الشباب, وليس اسلوب الملا والأمر والنهي وعرضلنا النموذجين أحدهما الشعب المتمردالذيياستعلى وايستكبار ولا يستجيب والنموذج الأأخر للشعب الوع المتدابار الذي يع ما",
            tag : "اليوم السابع" ,
            hash1 : "#اليوم_السابع",
            hash2 : "#اليوم_السابع" ,
        },
        {
            image:require("../../resources/newsImage.png"),
            title:"قال فضلت الامام الكبار: ان القرآنا الكريم استعمال منذ اسلوب الاحوارمع الشباب, وليس اسلوب الملا والأمر والنهي وعرضلنا النموذجين أحدهما",
            date:"منذ 1 دقيقة",
            desc:"قال فضلت الامام الكبار: ان القرآنا الكريم استعمال منذ اسلوب الاحوارمع الشباب, وليس اسلوب الملا والأمر والنهي وعرضلنا النموذجين أحدهما الشعب المتمردالذيياستعلى وايستكبار ولا يستجيب والنموذج الأأخر للشعب الوع المتدابار الذي يع ما",
            tag : "اليوم السابع" ,
            hash1 : "#اليوم_السابع",
            hash2 : "#اليوم_السابع" ,
        },
        {
            image:require("../../resources/newsImage.png"),
            title:"قال فضلت الامام الكبار: ان القرآنا الكريم استعمال منذ اسلوب الاحوارمع الشباب, وليس اسلوب الملا والأمر والنهي وعرضلنا النموذجين أحدهما",
            date:"منذ 1 دقيقة",
            desc:"قال فضلت الامام الكبار: ان القرآنا الكريم استعمال منذ اسلوب الاحوارمع الشباب, وليس اسلوب الملا والأمر والنهي وعرضلنا النموذجين أحدهما الشعب المتمردالذيياستعلى وايستكبار ولا يستجيب والنموذج الأأخر للشعب الوع المتدابار الذي يع ما",
            tag : "اليوم السابع" ,
            hash1 : "#اليوم_السابع",
            hash2 : "#اليوم_السابع" ,
        },

    ]

    return (
        <Slider items={news}/>
    )
    
}

export default NewsSlider;